# Regression Exercises

<hr style="border-top: 10px groove cyan; margin-top: 1px; margin-bottom: 1px"></hr>

## Exercises I - Required
Let's review the steps we take at the beginning of each new module.

1. Create a new repository named regression-exercises in your GitHub; all of your Regression work will be housed here.
2. Clone this repository within your local codeup-data-science directory.
3. Create a .gitignore and make sure your list of 'files to ignore' includes your env.py file.
4. Ceate a README.md file that outlines the contents and purpose of your repository.
5. Add, commit, and push these two files.
6. Now you can add your env.py file to this repository to access the Codeup database server.
7. For these exercises, you will create wrangle.ipynb and wrangle.py files to hold necessary functions.
8. As always, add, commit, and push your work often.

In [1]:
import pandas as pd
import numpy as np
import acquire

<hr style="border-top: 10px groove cyan; margin-top: 1px; margin-bottom: 1px"></hr>

## Exercises II - Required
Let's set up an example scenario as perspective for our regression exercises using the Telco dataset.

As a customer analyst for Telco, you want to know who has spent the most money with the company over their lifetime. You have monthly charges and tenure, so you think you will be able to use those two attributes as features to estimate total charges. You need to do this within an average of $5.00 per customer.

In these exercises, you will complete the first step toward the above goal: acquire and prepare the necessary Telco data from the telco_churn database in the Codeup database server.

1. Acquire customer_id, monthly_charges, tenure, and total_charges from the telco_churn database for all customers with a 2-year contract.
2. Using your acquired Telco data, walk through the summarization and cleaning steps in your wrangle.ipynb file like we did above. You may handle the missing values however you feel is appropriate and meaningful; remember to document your process and decisions using markdown and code commenting where helpful.
3. End with a wrangle.py file that contains the necessary functions to automate your process from acquiring the data to returning a cleaned dataframe with no missing values. Name your final function wrangle_telco.

In [25]:
query = "SELECT customer_id, monthly_charges, tenure, total_charges FROM customers WHERE `contract_type_id` = 3"

In [26]:
df = acquire.get_telco_data(query)

In [27]:
df.head()

  customer_id  monthly_charges  tenure total_charges
0  0013-SMEOE           109.70      71       7904.25
1  0014-BMAQU            84.65      63        5377.8
2  0016-QLJIS            90.45      65        5957.9
3  0017-DINOC            45.20      54       2460.55
4  0017-IUDMW           116.80      72       8456.75

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [29]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
monthly_charges,1695.0,60.770413,34.678865,18.4,24.025,64.35,90.45,118.75
tenure,1695.0,56.735103,18.209363,0.0,48.000,64.00,71.00,72.00

#### Takeaways
- total_charges is an object
- don't appear to be any blanks off the bat
- I know there are blanks in total_charges

In [30]:
# do value counts to see 10 spaces
df.total_charges.value_counts()

           10
1161.75     2
5714.2      2
3533.6      2
5682.25     2
           ..
2016.3      1
1177.95     1
3616.25     1
854.8       1
225.55      1
Name: total_charges, Length: 1678, dtype: int64

In [31]:
# see what the blank total charges look like
df[df.total_charges == ' ']

     customer_id  monthly_charges  tenure total_charges
234   1371-DWPAZ            56.05       0
416   2520-SGTTA            20.00       0
453   2775-SEFEE            61.90       0
505   3115-CZMZD            20.25       0
524   3213-VVOLG            25.35       0
678   4075-WKNIU            73.35       0
716   4367-NUYAO            25.75       0
726   4472-LVYGI            52.55       0
941   5709-LVOEQ            80.85       0
1293  7644-OMVMY            19.85       0

#### Dealing with the blanks (the whitespaces)
- they seem to have all tenure of 0 
- can replace total_charges with 0 because these people seem to have not been here for a month yet
- they haven't paid their first bill
- will replace total_charges with a 0 then convert to float

In [32]:
df['total_charges'] = df['total_charges'].str.replace(' ', '0').astype('float')

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 53.1+ KB

In [34]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
monthly_charges,1695.0,60.770413,34.678865,18.4,24.025,64.35,90.45,118.75
tenure,1695.0,56.735103,18.209363,0.0,48.000,64.00,71.00,72.00
total_charges,1695.0,3706.934336,2579.517834,0.0,1269.675,3593.80,5988.80,8672.45

In [38]:
def wrangle_telco():
    # get dataframe using get_telco_data function
    df = get_telco_data()
    # deal with space values (turn to 0s)
    df['total_charges'] = df['total_charges'].str.replace(' ', '0').astype('float')
    return df
# this is now in the wrangle.py file along with the aquire functions nessiscary

In [2]:
# import wrangle to test
import wrangle

In [4]:
# test function
test_df = wrangle.wrangle_telco()

In [5]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      7043 non-null   object
 1   monthly_charges  7043 non-null   float64
 2   tenure           7043 non-null   int64
 3   total_charges    7043 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 220.2+ KB

In [7]:
test_df.shape

(7043, 4)

In [10]:
test_df.describe().T

,count,mean,std,min,25%,50%,75%,max
monthly_charges,7043.0,64.761692,30.090047,18.25,35.50,70.35,89.85,118.75
tenure,7043.0,32.371149,24.559481,0.00,9.00,29.00,55.00,72.00
total_charges,7043.0,2279.734304,2266.794470,0.00,398.55,1394.55,3786.60,8684.80

In [12]:
test_df.total_charges.value_counts()

0.00       11
20.20      11
19.75       9
20.05       8
19.90       8
           ..
1756.60     1
4138.05     1
1401.15     1
6029.90     1
675.60      1
Name: total_charges, Length: 6531, dtype: int64